ShindouAris/WazeHUD/waze-hud/sdkconfig.defaults
# ESP32-2432S028R CYD: classic ESP32-WROOM-32, 4 MB flash, no PSRAM.
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=n
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# UART0 is reserved for HLP/1 through the onboard CH340 USB-UART bridge.
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_LOG_DEFAULT_LEVEL_NONE=y

# CONFIG_BT_ENABLED is not set

CONFIG_WAZE_HUD_SERIAL_BAUD=115200

CONFIG_WAZE_HUD_DISPLAY_CYD_28=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
